src/InformationRegisters/ar_ЗапрещённыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ЗапрещённыеОбъекты</Name>
			<Comment>Deny-list объектов базы данных, недоступных для изменения агентом. Проверяется L3.5 Guard в aosPermissionEngine.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонкретнаяСсылка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимЗапрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_РежимЗапретаЗаписи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_RiskLevel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_RiskLevel</Name>
			<Comment>Уровень риска инструмента (tool) агента: от безопасного чтения до необратимых операций</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Read</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Draft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Write</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Commit</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_ТипСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ТипСобытия</Name>
			<Comment>Тип записи в ar_СобытияЗапуска. Используется aosAuditСобытия.Зафиксировать и Run Viewer для классификации шагов цикла агента.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Started</Name>
					<Comment>Фиксируется при старте loop. Payload: {agent_id, trigger, user_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ContextBuilt</Name>
					<Comment>После aosRuntimeКонтекст.ПостроитьКонтекст. Payload: {tokens_estimate, layers}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LLMCalled</Name>
					<Comment>После получения ответа от провайдера. Payload: {model, prompt_tokens, completion_tokens, latency_ms}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCalled</Name>
					<Comment>После выполнения tool. Payload: {tool_name, arguments_json, observation, risk_level}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PermissionCheck</Name>
					<Comment>Результат aosPermissionEngine.РазрешитьДействие. Payload: {action, result, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ApprovalRequested</Name>
					<Comment>Action попал в очередь ar_ОчередьApproval. Payload: {approval_id, tool_name, risk_level, justification}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
					<Comment>Оператор принял действие в очереди подтверждений. Payload: {approval_id, user_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Rejected</Name>
					<Comment>Оператор отклонил действие в очереди подтверждений. Payload: {approval_id, user_id, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Denied</Name>
					<Comment>Permission engine вернул deny. Payload: {action, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Paused</Name>
					<Comment>Loop приостановлен перед approval; StateSnapshot сохранён. Payload: {approval_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Resumed</Name>
					<Comment>Loop возобновлён после approve через регламентное ar_ВозобновлениеПослеApproval. Payload: {approval_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
					<Comment>Финальный: LLM вернул stop без pending tool calls. Payload: {steps_total, tokens_total}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
					<Comment>Финальный: необработанное исключение в loop или сбой LLM. Payload: {error_text} (очищен через aosУтилиты.ОчиститьОшибкуДляLLM).</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MaxStepsReached</Name>
					<Comment>Финальный: счётчик шагов превысил МаксШагов агента. Payload: {steps_done, max_steps}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HookFailed</Name>
					<Comment>Hook-обработчик выбросил исключение. Ошибка изолирована — run продолжается. Payload: {hook_name, error_text}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SecretRotated</Name>
					<Comment>Ротация API-ключа или токена агента. Payload: {secret_kind} без значения ключа.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AuditPurged</Name>
					<Comment>Регламентная очистка ar_СобытияЗапуска завершена. Payload: {deleted_count, older_than_days}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expired</Name>
					<Comment>Pending-запись очереди approval истекла по TTL. Payload: {approval_id, ttl_hours}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RunInterruptedBySweeper</Name>
					<Comment>Зависший запуск помечен Interrupted регламентным заданием ar_ОчисткаЗависших (SCHED-04). Payload: {reason, threshold_sec}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MemoryProposed</Name>
					<Comment>Фиксируется при постановке proposal-записи в ar_ОчередьApproval регламентным заданием SCHED-09. Payload: {agents_processed, proposals_count, period_start}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WebhookTriggerAccepted</Name>
					<Comment>Агент запущен через HTTP POST /v1/agents/{id}/trigger (HTTPS-01). Payload: {agent_id, run_id, trigger, dry_run}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActionExecuted</Name>
					<Comment>Approved-действие фактически исполнено (объект записан). Payload: {approval_id, tool_name, document_ref}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ActionExecutionFailed</Name>
					<Comment>Approved-действие не исполнено: объект не записан. Payload: {approval_id, tool_name, reason}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PiiRuleChanged</Name>
					<Comment>Изменение/выключение/удаление правила в ar_ПравилаМаскированияПДн (PII-06). Payload: {action, object, field_name, masking_method, enabled, changed_by} без значения защищаемого поля.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCodeChanged</Name>
					<Comment>Историческое: изменение ar_КодРеализации у tool в режиме «Код» (создание/редактирование), зафиксированное в Catalogs.ar_Tools.ObjectModule.ПередЗаписью (SEC-TOOL-01). Payload: {tool, actor, code_hash, has_code} — код НЕ пишется в payload, только SHA-256 хеш. Механизм режима «Код» удалён в SEC-TOOL-02 — новые события этого типа не создаются, значение сохранено для читаемости старых записей аудита.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ToolCodePolicyChanged</Name>
					<Comment>Историческое: включение/выключение константы ar_РазрешитьТулыВРежимеКод через форму ar_Настройки (SEC-TOOL-01). Отдельно от ToolCodeChanged — это изменение политики диспетчеризации code-тулов, а не конкретного tool. Payload: {old_value, new_value, actor}. Константа физически удалена в SEC-TOOL-02 — новые события этого типа не создаются, значение сохранено для читаемости старых записей аудита.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PackageRegisteredUnsafe</Name>
					<Comment>Регистрация пакета tools (Справочник.ДополнительныеОтчетыИОбработки) с БезопасныйРежим=Ложь (PKG-05). Payload: {package, namespace, version, tools_count, actor}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PackageApprovalContractSuspect</Name>
					<Comment>Мутирующий пакетный tool (ТребуетApproval=Истина) вернул ответ без status=queued_for_approval/dry_run и без ключа error (PKG-05). Не блокирует вызов - только фиксация. Payload: {package, tool, run_id}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CodeToolsDisabled</Name>
					<Comment>Отключение tools в режиме «Код» при удалении механизма (SEC-TOOL-02). Payload: {disabled_tools: [{name, was_enabled}], actor: &quot;system_update&quot;}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SupervisorInvoked</Name>
					<Comment>Вызов ar_Надзор при завершении цикла (§3.1), до получения вердикта. Payload: {run_id, steps_done}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SupervisorDecision</Name>
					<Comment>Вердикт надзора получен и записан в ar_ПоследнееРешениеНадзора. Payload: {verdict, reason} (значение ar_ВердиктНадзора строкой + обоснование).</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ContinuationStarted</Name>
					<Comment>CONS-11: новый проход ReAct-цикла тем же RunId после вердикта надзора "Продолжить", прошедшего все три слоя детекции отсутствия прогресса (ar_Надзор.РешитьПродолжатьЛи). Payload: {code, reason} (reason - "run_completed"/"max_steps_reached").</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AutoResumed</Name>
					<Comment>Прерванный (Interrupted) запуск с валидным ar_StateSnapshot продолжен регламентным заданием ar_АвтовозобновлениеЗапусков (§3.5, CONS-09), а не человеком. Payload: {run_id, resumed_from_step}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RetryScheduled</Name>
					<Comment>Временный техсбой — назначен ar_ПовторитьПосле, увеличен ar_ПопытокВозобновления (§3.5). Payload: {attempt_number, retry_after, error_class}.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationSent</Name>
					<Comment>CONS-12: зафиксировано ar_Уведомления.Уведомить при реальной попытке отправки email об эскалации/approval/retry_exhausted - маркер дедупликации по RunId+повод (не сам факт успешной доставки). Payload: {reason} ("escalation"/"approval_pending"/"retry_exhausted").</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PlanUpdated</Name>
					<Comment>PLAN-01: фиксируется после успешного вызова tool update_plan (PLAN-03/04) - LLM объявила или изменила план работы. Payload: {steps_total, steps_done, steps: [{title, status}]}. Финальный состав Payload уточняется в PLAN-04.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_РежимЗапретаЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_РежимЗапретаЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Любое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ar_PermissionEngine/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_PermissionEngine (PermissionEngine / Движок разрешений).
//
// Центральный gate-компонент Runtime-цикла: для каждого tool call агента
// принимает решение allow / deny / approval_required. Заменяет degraded-стаб
// _СтабРазрешитьДействие в ar_RuntimeЦикл.
//
// Уровни проверки (выполняются последовательно, первый deny/approval_required
// прерывает цепочку):
//   L0: tool существует, включён и корректно настроен;
//   L1: tool в whitelist агента (ТЧ ДоступныеTools);
//   L2: проверка роли 1С - делегируется ar_PermissionRoles;
//   L3: лимиты - делегируется ar_PermissionЛимиты (МаксДействий, МаксСуммаДействия);
//   L3.5: Guard - deny-list ar_ЗапрещённыеОбъекты (PERM-05);
//   L4: матрица РежимАвтономии x RiskLevel + флаг ТребуетApproval.
//
// Свойства модуля: Сервер, без вызова с клиента, без привилегированного режима.
// Tools работают в правах пользователя сессии - RLS клиента действует естественно.
//
// См. спеку: .docs/specs/PERM-01.md, .docs/specs/PERM-05.md, Plan §2.8, §5.1-5.5.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Принять решение о разрешении action агента.
//
// Параметры:
//   ДанныеАгента    - Структура - {Ссылка, ИмяРоли1С, РежимАвтономии,
//                                  МаксДействий, МаксСуммаДействия, ...} либо Неопределено.
//   Действие        - Структура - {Имя/name, ИдВызова/id, Аргументы/args}.
//   КонтекстЗапуска - Структура - {RunId, Агент, РежимАвтономии, DryRun, ...}.
//
// Возвращаемое значение:
//   Структура - {Решение: "allow"|"deny"|"approval_required", Причина: Строка,
//                RiskLevel: ПеречислениеСсылка.ar_RiskLevel|Неопределено,
//                СсылкаTool: СправочникСсылка.ar_Tools|Неопределено}.
//
Функция РазрешитьДействие(ДанныеАгента, Действие, КонтекстЗапуска) Экспорт

	Попытка
		Возврат ВыполнитьПроверки(ДанныеАгента, Действие, КонтекстЗапуска);
	Исключение
		ТекстОшибки = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Deny("permission_engine_error: " + ТекстОшибки);
	КонецПопытки;

КонецФункции

// Проверить, запрещён ли тип (или экземпляр) объекта в реестре ar_ЗапрещённыеОбъекты.
//
// Используется как публичный helper для defence-in-depth в save_object (TOOL-18)
// и внутренне в L3.5 Guard.
//
// Параметры:
//   ТипОбъекта   - Строка - полное имя типа метаданных ("Справочник.Контрагенты")
//                           или "*" для проверки универсального wildcard-запрета.
//   РежимЗапрета - ПеречислениеСсылка.ar_РежимЗапретаЗаписи - режим проверяемой
//                           операции (Запись / Удаление / Любое).
//
// Возвращаемое значение:
//   Булево - Истина если объект запрещён, Ложь если разрешён.
//            При ошибке чтения реестра возвращает Истина (fail-closed).
//
Функция ОбъектЗапрещён(Знач ТипОбъекта, Знач РежимЗапрета) Экспорт

	Попытка
		Возврат ОбъектЗапрещёнВнутр(ТипОбъекта, РежимЗапрета, Неопределено);
	Исключение
		// fail-closed: при ошибке чтения реестра -запрещаем
		Возврат Истина;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Основная цепочка проверок L0-L5. Любой не-allow результат прерывает цепочку.
//
Функция ВыполнитьПроверки(ДанныеАгента, Действие, КонтекстЗапуска)

	// Защита от нулевых входов.
	Если ДанныеАгента = Неопределено Тогда
		Возврат Deny(НСтр("ru = 'agent_data_missing'; en = 'agent_data_missing'"));
	КонецЕсли;

	ИмяTool = ИзвлечьИмяTool(Действие);
	Если ПустаяСтрока(ИмяTool) Тогда
		Возврат Deny(НСтр("ru = 'empty_tool_name'; en = 'empty_tool_name'"));
	КонецЕсли;

	// L0: поиск tool в реестре ar_Tools.
	СсылкаTool = НайтиTool(ИмяTool);
	Если СсылкаTool = Неопределено Тогда
		Возврат Deny(НСтр("ru = 'tool_not_found'; en = 'tool_not_found'"));
	КонецЕсли;

	ДанныеTool = ПрочитатьДанныеTool(СсылкаTool);
	Если Не ДанныеTool.Включен Тогда
		Возврат Deny(НСтр("ru = 'tool_disabled'; en = 'tool_disabled'"));
	КонецЕсли;
	// У tool из пакета исполнитель - не общий модуль, а внешняя обработка
	// (ar_ToolПлагинВызов), поэтому ar_ОбщийМодуль и ar_ИмяПроцедуры у него
	// пусты по построению - проверка настройки к нему неприменима. Пустой
	// ИсточникТип трактуется как "Ядро" (обратная совместимость, PKG-02),
	// как и в ar_ToolDispatcher.ПричинаЕслиЯдровойМодульОтсутствует (PKG-09).
	ИсточникТипTool = ?(ПустаяСтрока(ДанныеTool.ИсточникТип), "Ядро", ДанныеTool.ИсточникТип);
	Если ИсточникТипTool = "Ядро"
		И (ПустаяСтрока(ДанныеTool.ОбщийМодуль) Или ПустаяСтрока(ДанныеTool.ИмяПроцедуры)) Тогда
		Возврат Deny(НСтр("ru = 'tool_misconfigured'; en = 'tool_misconfigured'"));
	КонецЕсли;

	// L1: whitelist. Режим «без агента» (UI-22, ar_RuntimeЦикл) не имеет ТЧ
	// ДоступныеTools (ДанныеАгента.Ссылка пустая) - whitelist проверяется по
	// КонтекстЗапуска.ОверрайдTools, который пользователь выбрал в форме
	// ar_Диалог. Для обычных агентов - прежняя проверка через ТЧ.
	БезАгента = Ложь;
	Если ТипЗнч(КонтекстЗапуска) = Тип("Структура") Тогда
		КонтекстЗапуска.Свойство("БезАгента", БезАгента);
	КонецЕсли;

	Если СокрЛП(ИмяTool) = "ask_user" Тогда
		// UI-30/TOOL-19: ask_user - служебный интерактивный tool (RiskLevel=Read,
		// ТребуетApproval=Ложь, регистрируется ядром в ar_ToolInteraction) -
		// доступен без включения в whitelist: вопрос уходит в очередь
		// awaiting_input с TTL, ничего в ИБ не меняет.
	ИначеЕсли БезАгента = Истина Тогда
		Если Не ToolВOverrideWhitelist(ИмяTool, КонтекстЗапуска) Тогда
			Возврат Deny(НСтр("ru = 'tool_not_in_whitelist'; en = 'tool_not_in_whitelist'"));
		КонецЕсли;
	ИначеЕсли ЕстьОверрайдTools(КонтекстЗапуска) Тогда
		// UI-30: пользователь переопределил набор tools на текущий диалог
		// (форма ar_Диалог) - whitelist проверяется по оверрайду, как в режиме
		// «без агента». Остальные слои (L2-L5) действуют без изменений.
		Если Не ToolВOverrideWhitelist(ИмяTool, КонтекстЗапуска) Тогда
			Возврат Deny(НСтр("ru = 'tool_not_in_whitelist'; en = 'tool_not_in_whitelist'"));
		КонецЕсли;
	Иначе
		Если Не ToolВWhitelist(ДанныеАгента.Ссылка, ИмяTool) Тогда
			Возврат Deny(НСтр("ru = 'tool_not_in_whitelist'; en = 'tool_not_in_whitelist'"));
		КонецЕсли;
	КонецЕсли;

	// L2: проверка роли 1С (членство текущего пользователя сессии в роли агента).
	РезультатРолей = ar_PermissionRoles.Проверить(ДанныеАгента, КонтекстЗапуска);
	Если РезультатРолей.Решение <> "allow" Тогда
		Возврат РезультатРолей;
	КонецЕсли;

	// L3: лимиты (МаксДействий, МаксСуммаДействия). Действие нужно для разбора
	// денежной суммы из аргументов tool.
	РезультатЛимитов = ar_PermissionЛимиты.Проверить(ДанныеАгента, ДанныеTool, КонтекстЗапуска, Действие);
	Если РезультатЛимитов.Решение <> "allow" Тогда
		Возврат РезультатЛимитов;
	КонецЕсли;

	// L3.5 Guard: deny-list ar_ЗапрещённыеОбъекты для Write/Commit-tools.
	// DryRun не обходит Guard -запрет важнее симуляции.
	// Активируется только для RiskLevel ∈ {Write, Commit}.
	Если ДанныеTool.RiskLevel = Перечисления.ar_RiskLevel.Write
		Или ДанныеTool.RiskLevel = Перечисления.ar_RiskLevel.Commit Тогда

		РезультатGuard = ПроверитьGuard(ДанныеTool, Действие, КонтекстЗапуска, СсылкаTool);
		Если РезультатGuard.Решение <> "allow" Тогда
			Возврат РезультатGuard;
		КонецЕсли;

	КонецЕсли;

	// L4: матрица РежимАвтономии x RiskLevel.
	РезультатL4 = ПроверитьРежимАвтономии(ДанныеАгента, ДанныеTool, СсылкаTool, ИмяTool);

	// L5 (опционально): LLM-критик для граничных случаев.
	// Вызывается только если флаг включён, результат L4 -граничный, не DryRun.
	DryRun = Ложь;
	КонтекстЗапуска.Свойство("DryRun", DryRun);

	Если ar_Константы.ВключитьCriticLLM()
		И РезультатL4.Решение = "approval_required"
		И ar_PermissionCritic.ЭтоГраничныйСлучай(РезультатL4)
		И Не DryRun Тогда
		Возврат ar_PermissionCritic.Уточнить(ДанныеАгента, Действие, КонтекстЗапуска, РезультатL4);
	КонецЕсли;

	Возврат РезультатL4;

КонецФункции

// Извлечь имя tool из действия. Действие - Структура от ar_RuntimeПарсер.
// Поле "Имя" (основное), либо "name" (на случай иной сериализации).
//
Функция ИзвлечьИмяTool(Действие)

	Имя = "";
	Если ТипЗнч(Действие) = Тип("Структура") Тогда
		Действие.Свойство("Имя", Имя);
		Если ПустаяСтрока(Строка(Имя)) Тогда
			Имя = "";
			Действие.Свойство("name", Имя);
		КонецЕсли;
	КонецЕсли;
	Возврат СокрЛП(Строка(Имя));

КонецФункции

// Поиск tool по snake_case-имени (реквизит ar_Имя) в справочнике ar_Tools.
//
Функция НайтиTool(ИмяTool)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Tools.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ar_Tools КАК Tools
		|ГДЕ
		|	Tools.ar_Имя = &Имя
		|	И Tools.ПометкаУдаления = Ложь";
	Запрос.УстановитьПараметр("Имя", ИмяTool);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

// Прочитать свойства tool. Возвращает Структуру с ключами:
// Включен, ОбщийМодуль, ИмяПроцедуры, RiskLevel, ТребуетApproval.
//
Функция ПрочитатьДанныеTool(СсылкаTool)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Tools.ar_Включён КАК Включен,
		|	Tools.ar_ОбщийМодуль КАК ОбщийМодуль,
		|	Tools.ar_ИмяПроцедуры КАК ИмяПроцедуры,
		|	Tools.ar_ИсточникТип КАК ИсточникТип,
		|	Tools.ar_RiskLevel КАК RiskLevel,
		|	Tools.ar_ТребуетApproval КАК ТребуетApproval
		|ИЗ
		|	Справочник.ar_Tools КАК Tools
		|ГДЕ
		|	Tools.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаTool);
	Выборка = Запрос.Выполнить().Выбрать();

	Данные = Новый Структура;
	Данные.Вставить("Включен",         Ложь);
	Данные.Вставить("ОбщийМодуль",     "");
	Данные.Вставить("ИмяПроцедуры",    "");
	Данные.Вставить("ИсточникТип",     "");
	Данные.Вставить("RiskLevel",       Неопределено);
	Данные.Вставить("ТребуетApproval", Ложь);

	Если Выборка.Следующий() Тогда
		Данные.Включен         = Выборка.Включен = Истина;
		Данные.ОбщийМодуль     = СокрЛП(Строка(Выборка.ОбщийМодуль));
		Данные.ИмяПроцедуры    = СокрЛП(Строка(Выборка.ИмяПроцедуры));
		Данные.ИсточникТип     = СокрЛП(Строка(Выборка.ИсточникТип));
		Данные.RiskLevel       = Выборка.RiskLevel;
		Данные.ТребуетApproval = Выборка.ТребуетApproval = Истина;
	КонецЕсли;

	Возврат Данные;

КонецФункции

// Проверить наличие tool в ТЧ ДоступныеTools агента (поле ar_Tool).
//
// Реквизит ТЧ ar_Tool - СТРОКА с именем tool (ar_Имя), не ссылка на справочник
// (см. Catalogs/ar_Агенты.xml: Строка(150); форма карточки агента пишет туда
// имя). Сравнение со ссылкой не находило ни одной строки, и любой вызов
// инструмента агентом отклонялся как tool_not_in_whitelist.
//
// Параметры:
//   СсылкаАгент - СправочникСсылка.ar_Агенты - агент, чей whitelist проверяем.
//   ИмяTool     - Строка - техническое имя tool (ar_Имя).
//
// Возвращаемое значение:
//   Булево - Истина, если tool включён в ТЧ агента.
//
Функция ToolВWhitelist(СсылкаАгент, ИмяTool)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Признак
		|ИЗ
		|	Справочник.ar_Агенты.ar_ДоступныеTools КАК ДоступныеTools
		|ГДЕ
		|	ДоступныеTools.Ссылка = &Агент
		|	И ДоступныеTools.ar_Tool = &Тул
		|	И ДоступныеTools.ar_Включен = ИСТИНА";
	Запрос.УстановитьПараметр("Агент", СсылкаАгент);
	Запрос.УстановитьПараметр("Тул",   СокрЛП(Строка(ИмяTool)));

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Проверить наличие tool в whitelist режима «без агента» (UI-22) -
// КонтекстЗапуска.ОверрайдTools, список имён, выбранный пользователем в
// форме ar_Диалог при постановке запуска (см. ar_RuntimeЗапуск.
// СтартоватьВФонеБезАгента, ar_RuntimeЦикл.КонтекстЗапуска).
//
// Параметры:
//   ИмяTool         - Строка - имя tool из tool call.
//   КонтекстЗапуска - Структура - ключ ОверрайдTools (Массив строк-имён).
//
// Возвращаемое значение:
//   Булево - Истина, если ИмяTool входит в ОверрайдTools.
//
// UI-30: есть ли в контексте запуска непустой оверрайд tools (агентский запуск
// с переопределённым в диалоге набором).
//
Функция ЕстьОверрайдTools(КонтекстЗапуска)

	ОверрайдTools = Неопределено;
	Если ТипЗнч(КонтекстЗапуска) = Тип("Структура") Тогда
		КонтекстЗапуска.Свойство("ОверрайдTools", ОверрайдTools);
	КонецЕсли;
	Возврат ТипЗнч(ОверрайдTools) = Тип("Массив") И ОверрайдTools.Количество() > 0;

КонецФункции

Функция ToolВOverrideWhitelist(Знач ИмяTool, КонтекстЗапуска)

	ОверрайдTools = Неопределено;
	Если ТипЗнч(КонтекстЗапуска) = Тип("Структура") Тогда
		КонтекстЗапуска.Свойство("ОверрайдTools", ОверрайдTools);
	КонецЕсли;
	Если ТипЗнч(ОверрайдTools) <> Тип("Массив") Тогда
		Возврат Ложь;
	КонецЕсли;

	ИмяTool = СокрЛП(ИмяTool);
	Для Каждого Имя Из ОверрайдTools Цикл
		Если СокрЛП(Строка(Имя)) = ИмяTool Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// L4: матрица РежимАвтономии x RiskLevel + флаг ТребуетApproval.
//
Функция ПроверитьРежимАвтономии(ДанныеАгента, ДанныеTool, СсылкаTool, Знач ИмяTool = "")

	RiskLevel = ДанныеTool.RiskLevel;
	ТребуетApproval = ДанныеTool.ТребуетApproval;

	РежимАвтономии = ДанныеАгента.РежимАвтономии;
	// Если режим не задан или неизвестен - трактуем как manual (наиболее осторожный).
	Если Не ЗначениеЗаполнено(РежимАвтономии) Тогда
		РежимАвтономии = Перечисления.ar_РежимАвтономии.Manual;
	КонецЕсли;

	// read_only: разрешаем только read, всё остальное - deny (приоритетнее ТребуетApproval).
	Если РежимАвтономии = Перечисления.ar_РежимАвтономии.ReadOnly Тогда
		Если RiskLevel = Перечисления.ar_RiskLevel.Read Тогда
			Возврат Allow(СсылкаTool, RiskLevel);
		Иначе
			Возврат Deny(НСтр("ru = 'read_only_agent_write_attempt';
				|en = 'read_only_agent_write_attempt'"));
		КонецЕсли;
	КонецЕсли;

	// Принудительный approval по флагу tool (не действует для read_only - обработан выше).
	Если ТребуетApproval Тогда
		Возврат ApprovalRequired(НСтр("ru = 'tool_requires_approval';
			|en = 'tool_requires_approval'"), СсылкаTool, RiskLevel);
	КонецЕсли;

	// MEM-01: remember - служебная запись в память агента (RiskLevel=Write,
	// ТребуетApproval=Ложь), не изменяет прикладные данные ИБ - не должна
	// прерывать диалог approval-карточкой даже в Manual/AutoThreshold
	// (см. порог режима ниже). Точечное исключение по имени, как ask_user выше.
	Если СокрЛП(ИмяTool) = "remember" Тогда
		Возврат Allow(СсылкаTool, RiskLevel);
	КонецЕсли;

	// manual / auto_threshold / autonomous: порог risk-level зависит от режима.
	Возврат ПрименитьПорогРежима(РежимАвтономии, RiskLevel, СсылкаTool);

КонецФункции

// Для режимов manual / auto_threshold / autonomous вернуть allow либо approval
// в зависимости от RiskLevel относительно порога режима. Неизвестный режим - deny.
//
Функция ПрименитьПорогРежима(РежимАвтономии, RiskLevel, СсылкаTool)

	// manual: разрешён только read, остальное - approval.
	Если РежимАвтономии = Перечисления.ar_РежимАвтономии.Manual Тогда
		Если RiskLevel = Перечисления.ar_RiskLevel.Read Тогда
			Возврат Allow(СсылкаTool, RiskLevel);
		КонецЕсли;
		Возврат ApprovalRequired(НСтр("ru = 'manual_mode_non_read_action';
			|en = 'manual_mode_non_read_action'"), СсылкаTool, RiskLevel);
	КонецЕсли;

	// auto_threshold: read и draft - allow; write и commit - approval.
	Если РежимАвтономии = Перечисления.ar_РежимАвтономии.AutoThreshold Тогда
		Если RiskLevel = Перечисления.ar_RiskLevel.Read
			Или RiskLevel = Перечисления.ar_RiskLevel.Draft Тогда
			Возврат Allow(СсылкаTool, RiskLevel);
		КонецЕсли;
		Возврат ApprovalRequired(НСтр("ru = 'auto_threshold_high_risk';
			|en = 'auto_threshold_high_risk'"), СсылкаTool, RiskLevel);
	КонецЕсли;

	// autonomous: всё кроме commit - allow; commit - approval.
	Если РежимАвтономии = Перечисления.ar_РежимАвтономии.Autonomous Тогда
		Если RiskLevel = Перечисления.ar_RiskLevel.Commit Тогда
			Возврат ApprovalRequired(НСтр("ru = 'commit_always_requires_approval';
				|en = 'commit_always_requires_approval'"), СсылкаTool, RiskLevel);
		КонецЕсли;
		Возврат Allow(СсылкаTool, RiskLevel);
	КонецЕсли;

	// Неизвестный режим - deny (fail-safe).
	Возврат Deny(НСтр("ru = 'unknown_autonomy_mode'; en = 'unknown_autonomy_mode'"));

КонецФункции

// ---- L3.5 Guard: deny-list ar_ЗапрещённыеОбъекты ----

// Выполнить проверку Guard для Write/Commit-action.
// Вызывается из ВыполнитьПроверки только при RiskLevel ∈ {Write, Commit}.
//
// Параметры:
//   ДанныеTool      - Структура - свойства tool (RiskLevel, ...).
//   Действие        - Структура - действие агента с аргументами.
//   КонтекстЗапуска - Структура - {RunId, DryRun, ...}.
//   СсылкаTool      - СправочникСсылка.ar_Tools - ссылка на tool (для Allow).
//
// Возвращаемое значение:
//   Структура - результат (allow / deny).
//
Функция ПроверитьGuard(Знач ДанныеTool, Знач Действие, Знач КонтекстЗапуска, Знач СсылкаTool)

	ТипОбъекта   = ИзвлечьТипОбъекта(Действие);
	РежимЗапрета = РежимЗапретаПоRiskLevel(ДанныеTool.RiskLevel);

	КонкретнаяСсылка = ИзвлечьКонкретнуюСсылку(Действие);

	DryRun = Ложь;
	КонтекстЗапуска.Свойство("DryRun", DryRun);

	RunId = "";
	КонтекстЗапуска.Свойство("RunId", RunId);

	ТекстПричины = "";
	Запрещено = Ложь;
	Попытка
		Запрещено = ОбъектЗапрещёнВнутр(ТипОбъекта, РежимЗапрета, КонкретнаяСсылка, ТекстПричины);
	Исключение
		// fail-closed: ошибка чтения реестра -запрещаем
		ТекстОшибки = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		// Аудит guard_read_error (только если не DryRun)
		Если Не DryRun Тогда
			ПэйлоадОшибки = Новый Структура;
			ПэйлоадОшибки.Вставить("code",  "guard_read_error");
			ПэйлоадОшибки.Вставить("error", ТекстОшибки);
			Попытка
				ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно(RunId,
					Перечисления.ar_ТипСобытия.Denied, ПэйлоадОшибки);
			Исключение
				// Ошибка аудита не должна прерывать permission check.
				// Намеренный no-op: сбой записи аудита не влияет на результат Guard.
				ЗаписьЖурналаРегистрации("ar_PermissionEngine.Guard",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					НСтр("ru = 'Сбой ar_AuditСобытия при guard_read_error';
						|en = 'ar_AuditСобытия failed on guard_read_error'"));
			КонецПопытки;
		КонецЕсли;

		Возврат Deny(НСтр("ru = 'object_write_forbidden_guard_error';
			|en = 'object_write_forbidden_guard_error'"));
	КонецПопытки;

	Если Запрещено Тогда
		// Аудит write_forbidden (только если не DryRun)
		Если Не DryRun Тогда
			ПэйлоадЗапрета = Новый Структура;
			ПэйлоадЗапрета.Вставить("code",        "write_forbidden");
			ПэйлоадЗапрета.Вставить("object_type", ТипОбъекта);
			ПэйлоадЗапрета.Вставить("tool",        ИзвлечьИмяTool(Действие));
			Попытка
				ar_AuditЗащищённыйРежим.ЗаписатьСобытиеПривилегированно(RunId,
					Перечисления.ar_ТипСобытия.Denied, ПэйлоадЗапрета);
			Исключение
				// Ошибка аудита не должна прерывать permission check.
				// Намеренный no-op: сбой записи аудита не влияет на результат Guard.
				ЗаписьЖурналаРегистрации("ar_PermissionEngine.Guard",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					НСтр("ru = 'Сбой ar_AuditСобытия при write_forbidden';
						|en = 'ar_AuditСобытия failed on write_forbidden'"));
			КонецПопытки;
		КонецЕсли;

		ПричинаDeny = НСтр("ru = 'object_write_forbidden';
			|en = 'object_write_forbidden'");
		Если Не ПустаяСтрока(ТекстПричины) Тогда
			ПричинаDeny = ПричинаDeny + ": " + ТекстПричины;
		КонецЕсли;
		Возврат Deny(ПричинаDeny);
	КонецЕсли;

	// Guard пропустил -передаём управление L4
	Возврат Allow(СсылкаTool, ДанныеTool.RiskLevel);

КонецФункции

// Внутренняя реализация запроса к deny-list ar_ЗапрещённыеОбъекты.
//
// Параметры:
//   ТипОбъекта        - Строка - полное имя типа метаданных или "*" для wildcard.
//   РежимЗапрета      - ПеречислениеСсылка.ar_РежимЗапретаЗаписи - режим операции.
//   КонкретнаяСсылка  - Произвольный | Неопределено - конкретный объект.
//   ТекстПричины      - Строка - [out] заполняется из поля Причина записи реестра.
//
// Возвращаемое значение:
//   Булево - Истина если объект запрещён, Ложь если разрешён.
//
Функция ОбъектЗапрещёнВнутр(Знач ТипОбъекта, Знач РежимЗапрета,
	Знач КонкретнаяСсылка = Неопределено, ТекстПричины = "")

	Запрос = Новый Запрос;
	// Запрос к deny-list: отбор по типу объекта (с wildcard "*") и режиму запрета
	// (с учётом режима "Любое"). Использование ИЛИ в ГДЕ допустимо - deny-list
	// содержит единицы-десятки записей, индексы по измерениям создаются платформой.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапрещённыеОбъекты.Включен КАК Включен,
		|	ЗапрещённыеОбъекты.Причина КАК Причина,
		|	ЗапрещённыеОбъекты.КонкретнаяСсылка КАК КонкретнаяСсылка
		|ИЗ
		|	РегистрСведений.ar_ЗапрещённыеОбъекты КАК ЗапрещённыеОбъекты
		|ГДЕ
		|	ЗапрещённыеОбъекты.Включен = Истина
		|	И (ЗапрещённыеОбъекты.ТипОбъекта = &ТипОбъекта
		|		ИЛИ ЗапрещённыеОбъекты.ТипОбъекта = ""*"")
		|	И (ЗапрещённыеОбъекты.РежимЗапрета = &РежимЗапрета
		|		ИЛИ ЗапрещённыеОбъекты.РежимЗапрета = &РежимЛюбое)";
	Запрос.УстановитьПараметр("ТипОбъекта",  ТипОбъекта);
	Запрос.УстановитьПараметр("РежимЗапрета", РежимЗапрета);
	Запрос.УстановитьПараметр("РежимЛюбое",
		Перечисления.ar_РежимЗапретаЗаписи.Любое);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		// Если КонкретнаяСсылка заполнена в записи -дополнительная проверка
		СсылкаИзЗаписи = Неопределено;
		Если ЗначениеЗаполнено(Выборка.КонкретнаяСсылка) Тогда
			Попытка
				// КонкретнаяСсылка хранится как ХранилищеЗначения
				СсылкаИзЗаписи = Выборка.КонкретнаяСсылка.Получить();
			Исключение
				// Некорректное хранилище -пропускаем запись, логируем для аудита данных
				ЗаписьЖурналаРегистрации("ar_PermissionEngine.Guard",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					НСтр("ru = 'Ошибка чтения КонкретнаяСсылка из ar_ЗапрещённыеОбъекты';
						|en = 'Error reading concrete ref from ar_ЗапрещённыеОбъекты'"));
				Продолжить;
			КонецПопытки;
		КонецЕсли;

		Если ЗначениеЗаполнено(СсылкаИзЗаписи) Тогда
			// Запрет на конкретный экземпляр -проверяем совпадение
			Если КонкретнаяСсылка = Неопределено
				Или КонкретнаяСсылка <> СсылкаИзЗаписи Тогда
				Продолжить; // Не наш экземпляр
			КонецЕсли;
		КонецЕсли;

		// Совпадение найдено
		ТекстПричины = СокрЛП(Строка(Выборка.Причина));
		Возврат Истина;

	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Извлечь ТипОбъекта из аргументов действия.
// Ищет ключи "object_type" и "тип_объекта".
// При отсутствии возвращает "" -Guard проверит только wildcard "*".
//
// Параметры:
//   Действие - Структура - действие агента (от ar_RuntimeПарсер).
//
// Возвращаемое значение:
//   Строка - тип объекта или "" если аргумент не передан.
//
Функция ИзвлечьТипОбъекта(Знач Действие)

	ТипОбъекта = "";
	Аргументы  = Неопределено;
	Если ТипЗнч(Действие) = Тип("Структура") Тогда
		Действие.Свойство("Аргументы", Аргументы);
		Если Аргументы = Неопределено Тогда
			Действие.Свойство("args", Аргументы);
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Аргументы) = Тип("Соответствие") Тогда
		ЗначОТ = Аргументы.Получить("object_type");
		Если ЗначОТ = Неопределено Тогда
			ЗначОТ = Аргументы.Получить("тип_объекта");
		КонецЕсли;
		Если ЗначОТ <> Неопределено Тогда
			ТипОбъекта = СокрЛП(Строка(ЗначОТ));
		КонецЕсли;
	КонецЕсли;

	Возврат ТипОбъекта;

КонецФункции

// Извлечь конкретную ссылку из аргументов действия (поле "ref" или "ссылка").
// Полная реализация TOOL-18: читает поле "ref" из аргументов, разыменовывает
// в ссылку через ar_ToolUniversal.РазыменоватьСсылку.
// При отсутствии поля или ошибке разыменования возвращает Неопределено.
//
// Параметры:
//   Действие - Структура - действие агента {Аргументы/args, ...}.
//
// Возвращаемое значение:
//   Произвольный | Неопределено - конкретная ссылка объекта или Неопределено.
//
Функция ИзвлечьКонкретнуюСсылку(Знач Действие)

	Аргументы = Неопределено;
	Если ТипЗнч(Действие) = Тип("Структура") Тогда
		Действие.Свойство("Аргументы", Аргументы);
		Если Аргументы = Неопределено Тогда
			Действие.Свойство("args", Аргументы);
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(Аргументы) <> Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Извлечь строку ref.
	ЗначRef = Аргументы.Получить("ref");
	Если ЗначRef = Неопределено Тогда
		ЗначRef = Аргументы.Получить("ссылка");
	КонецЕсли;
	Если ЗначRef = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СтрокаRef = СокрЛП(Строка(ЗначRef));
	Если ПустаяСтрока(СтрокаRef) Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Извлечь object_type для помощи при разыменовании UUID.
	ТипОбъекта = "";
	ЗначТипа = Аргументы.Получить("object_type");
	Если ЗначТипа <> Неопределено Тогда
		ТипОбъекта = СокрЛП(Строка(ЗначТипа));
	КонецЕсли;

	// Разыменовать через ar_ToolUniversal — не дублируем логику.
	Попытка
		Ссылка = ar_ToolUniversal.РазыменоватьСсылку(СтрокаRef, ТипОбъекта);
		Возврат Ссылка;
	Исключение
		// При ошибке разыменования возвращаем Неопределено (Guard продолжит с wildcard-проверкой).
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Сопоставить RiskLevel с режимом запрета ar_РежимЗапретаЗаписи.
//   Write  ->Запись
//   Commit ->Любое
//
// Параметры:
//   RiskLevel - ПеречислениеСсылка.ar_RiskLevel - уровень риска tool.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ar_РежимЗапретаЗаписи - режим запрета.
//
Функция РежимЗапретаПоRiskLevel(Знач RiskLevel)
	Если RiskLevel = Перечисления.ar_RiskLevel.Commit Тогда
		Возврат Перечисления.ar_РежимЗапретаЗаписи.Любое;
	КонецЕсли;
	Возврат Перечисления.ar_РежимЗапретаЗаписи.Запись;
КонецФункции

// ---- Helpers возвращаемых структур ----

Функция Allow(СсылкаTool, RiskLevel)
	Результат = Новый Структура;
	Результат.Вставить("Решение",    "allow");
	Результат.Вставить("Причина",    "");
	Результат.Вставить("RiskLevel",  RiskLevel);
	Результат.Вставить("СсылкаTool", СсылкаTool);
	Возврат Результат;
КонецФункции

Функция Deny(Причина)
	Результат = Новый Структура;
	Результат.Вставить("Решение",    "deny");
	Результат.Вставить("Причина",    Причина);
	Результат.Вставить("RiskLevel",  Неопределено);
	Результат.Вставить("СсылкаTool", Неопределено);
	Возврат Результат;
КонецФункции

Функция ApprovalRequired(Причина, СсылкаTool, RiskLevel)
	Результат = Новый Структура;
	Результат.Вставить("Решение",    "approval_required");
	Результат.Вставить("Причина",    Причина);
	Результат.Вставить("RiskLevel",  RiskLevel);
	Результат.Вставить("СсылкаTool", СсылкаTool);
	Возврат Результат;
КонецФункции

#КонецОбласти
